# Series

In [1]:
import numpy as np
import pandas as pd

In [11]:
lables = ['a', 'b', 'c','d']
my_data = [10,20,30,40]
arr = np.array(my_data)
d = {'a':40, 'b': 70,'c':30,'d':90}

In [3]:
pd.Series(data = my_data) # pandas series

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
# specify the index
pd.Series(data = my_data, index = lables)

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
# passing numpy array to series
pd.Series(arr)

0    10
1    20
2    30
3    40
dtype: int32

In [7]:
# passing numpy array to series and specify index
pd.Series(arr,lables)

a    10
b    20
c    30
d    40
dtype: int32

In [12]:
#passing dictionary to series
pd.Series(d)

a    40
b    70
c    30
d    90
dtype: int64

In [14]:
ser1 = pd.Series([1,2,3,4],['USA','Japan','China','Italy'])
ser1

USA      1
Japan    2
China    3
Italy    4
dtype: int64

In [27]:
ser2 = pd.Series([1,2,6,8],['USA','Japan','BD','Italy'])

In [15]:
ser1['USA'] # return the value corresponding to the lebel

1

In [32]:
ser3 = pd.Series(data = lables)
ser3

0    a
1    b
2    c
3    d
dtype: object

In [34]:
ser3[1]

'b'

In [35]:
ser1

USA      1
Japan    2
China    3
Italy    4
dtype: int64

In [36]:
ser2

USA      1
Japan    2
BD       6
Italy    8
dtype: int64

In [37]:
# add 2 series
ser1+ser2  # add the matching index values.

BD        NaN
China     NaN
Italy    12.0
Japan     4.0
USA       2.0
dtype: float64

# DataFrames Part 1

In [38]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [39]:
np.random.seed(101) # seed means same random number

In [41]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) # 'A','B' are the index and 'W','X' are the columns

In [42]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [43]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [44]:
type(df['W']) #values from the W columns

pandas.core.series.Series

In [45]:
type(df)

pandas.core.frame.DataFrame

In [78]:
df[['W','Z']] #values from multiple columns

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752

In [55]:
df['new'] = df['X'] # add a new columns
df['new']

A    1.693723
B    0.390528
C    0.072960
D   -0.754070
E    1.901755
Name: new, dtype: float64

In [53]:
df['new2'] = df['X'] + df['Z'] # add 2 columns and create a new column
df['new2']

A    0.534604
B    0.575030
C    0.402606
D   -0.269318
E    3.898407
Name: new2, dtype: float64

In [1]:
df

NameError: name 'df' is not defined

###  Delete

In [72]:
# delete a column 
df.drop('new',axis=1) # axis=1 means the column. This doesn't affact the main frame

          W         X         Y
A  0.302665  1.693723 -1.706086
B -0.134841  0.390528  0.166905
C  0.807706  0.072960  0.638787
D -0.497104 -0.754070 -0.943406
E -0.116773  1.901755  0.238127

In [74]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [68]:
df.drop('new2', axis=1, inplace=True) # inplace=True make the parmanent delete

KeyError: "['new2'] not found in axis"

In [69]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [70]:
#Delete Row
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [71]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [76]:
df.drop('E',axis=0,inplace=True)

KeyError: "['E'] not found in axis"

In [77]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [80]:
# Selecting Row
df.loc['B']

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [81]:
# index based location to select Row
df.iloc[1]

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [83]:
# select single value
df.loc['B','Y']

0.16690463609281317

In [84]:
# subset of values
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

# DataFrames Part 2

In [ ]:
np.random.seed(101)

In [85]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) 
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [86]:
#Conditional Selection
df > 0

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [89]:
# values that > 0
df[df>0]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [90]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [91]:
# conditional selection column 
df['W'] > 0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [96]:
# select the only row where W>0
df[df['W']>0]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [94]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [95]:
# select the only row where Z<0
df[df['Z']<0]

          W         X         Y         Z
C  2.154846 -0.610259 -0.755325 -0.346419

In [101]:
#return the X column if W>0
"""
Breakdown of-- df[df['W']>0]['X']
boolser = df['W']>0
result = df[boolser]
myCol = ['X']
result[myCol]

"""

df[df['W']>0]['X']

B   -0.156598
C   -0.610259
D   -0.479448
Name: X, dtype: float64

In [ ]:
#Multiple Condition

In [104]:
df[(df['W']>0) & (df['X']<0)] # select only the row where W>0 and X<0

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [111]:
df[(df['X'] > 0) | (df['Y'] > 1)] # select only the row where X>0 or Y>1

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
E -0.925874  1.862864 -1.133817  0.610478

In [113]:
#Reset the dataframe index
df.reset_index() # use reset_index(inplace=TRUE) to reset the main dataframe

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [117]:
# add new colmun
newind = ['USA','Germany','China','France','Japan']
df['Country'] = newind
df

          W         X         Y         Z  Country
A -0.993263  0.196800 -1.136645  0.000366      USA
B  1.025984 -0.156598 -0.031579  0.649826  Germany
C  2.154846 -0.610259 -0.755325 -0.346419    China
D  0.147027 -0.479448  0.558769  1.024810   France
E -0.925874  1.862864 -1.133817  0.610478    Japan

In [118]:
# set column as index
df.set_index('Country')#use reset_index('Country',inplace=TRUE) to reset the main dataframe

                W         X         Y         Z
Country
USA     -0.993263  0.196800 -1.136645  0.000366
Germany  1.025984 -0.156598 -0.031579  0.649826
China    2.154846 -0.610259 -0.755325 -0.346419
France   0.147027 -0.479448  0.558769  1.024810
Japan   -0.925874  1.862864 -1.133817  0.610478

# DataFrames Part 3

In [3]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [4]:
#Index level
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [5]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [6]:
inside

[1, 2, 3, 1, 2, 3]

In [7]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [8]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [9]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  1.111271  0.703457
   2 -0.720791  1.482185
   3 -1.116664 -1.140644
G2 1 -0.492206  0.613035
   2 -1.193818  1.400983
   3  0.766185  1.089285

In [12]:
df.loc['G1']

          A         B
1  1.111271  0.703457
2 -0.720791  1.482185
3 -1.116664 -1.140644

In [14]:
df.loc['G1'].loc[1]

A    1.111271
B    0.703457
Name: 1, dtype: float64

In [15]:
df.index.names

FrozenList([None, None])

In [16]:
df.index.names = ['Groups', 'Num'] #set name of index

In [17]:
df

                   A         B
Groups Num
G1     1    1.111271  0.703457
       2   -0.720791  1.482185
       3   -1.116664 -1.140644
G2     1   -0.492206  0.613035
       2   -1.193818  1.400983
       3    0.766185  1.089285

In [20]:
df.loc['G2'].loc[2].loc['B']

1.4009831203206242

In [21]:
df.loc['G1'].loc[3].loc['A']

-1.1166644598381796

In [22]:
# cross section
# get everything under G1
df.xs('G1')

            A         B
Num
1    1.111271  0.703457
2   -0.720791  1.482185
3   -1.116664 -1.140644

In [24]:
# get all the groups value of index 1
df.xs(1,level='Num')

               A         B
Groups
G1      1.111271  0.703457
G2     -0.492206  0.613035

# Missing Data

In [1]:
import numpy as np
import pandas as pd

In [5]:
#create data frame from dictionary
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]} # there is some null values

In [4]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
#drop all row of missing values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [9]:
#drop all column of missing values
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [14]:
# keep the if there is given number of no-nan values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [16]:
#Replace missing values
df.fillna(value='Fill Value') # fill string values

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [17]:
df.fillna(value=100) #fill int values

       A      B  C
0    1.0    5.0  1
1    2.0  100.0  2
2  100.0  100.0  3

In [18]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [19]:
df['A'].fillna(value=df['A'].mean()) # fill the column A missing value with the mean of A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [20]:
#Group together row based on column

In [21]:
import numpy as np
import pandas as pd

In [22]:
data = {'Company': ['Google', 'Google', 'Google','Fb','Fb','Soft'], 
        'Person':['Sam','Shmith','Adam','Sajib','Fahim','Arif'],
       'Sales':[150,200,400,210,560,900]}

In [30]:
df = pd.DataFrame(data)
df

  Company  Person  Sales
0  Google     Sam    150
1  Google  Shmith    200
2  Google    Adam    400
3      Fb   Sajib    210
4      Fb   Fahim    560
5    Soft    Arif    900

In [31]:
byComp = df.groupby('Company')

In [34]:
#mean of sales
#string values are ignored 
byComp.mean()

         Sales
Company
Fb       385.0
Google   250.0
Soft     900.0

In [35]:
#sum 
byComp.sum()

         Sales
Company
Fb         770
Google     750
Soft       900

In [36]:
#standard deviation 
byComp.std()

              Sales
Company
Fb       247.487373
Google   132.287566
Soft            NaN

In [39]:
#sum of specific column
df.groupby('Company').sum().loc['Fb']

Sales    770
Name: Fb, dtype: int64

In [46]:
# sum of person sales groupby Person
df.groupby('Person').sum().loc['Sajib']

Sales    210
Name: Sajib, dtype: int64

In [47]:
df

  Company  Person  Sales
0  Google     Sam    150
1  Google  Shmith    200
2  Google    Adam    400
3      Fb   Sajib    210
4      Fb   Fahim    560
5    Soft    Arif    900

In [45]:
#count the number of instances of column
df.groupby('Company').count()

         Person  Sales
Company
Fb            2      2
Google        3      3
Soft          1      1

In [48]:
# max sales of the each company group
df.groupby('Company').max()

         Person  Sales
Company
Fb        Sajib    560
Google   Shmith    400
Soft       Arif    900

In [49]:
# min sales of the each company group
df.groupby('Company').min()

        Person  Sales
Company
Fb       Fahim    210
Google    Adam    150
Soft      Arif    900

In [54]:
#describe useful information about each company group
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
Fb        2.0  385.0  247.487373  210.0  297.5  385.0  472.5  560.0
Google    3.0  250.0  132.287566  150.0  175.0  200.0  300.0  400.0
Soft      1.0  900.0         NaN  900.0  900.0  900.0  900.0  900.0

In [62]:
#describe useful information about single company 
df.groupby('Company').describe().transpose()['Fb']

Sales  count      2.000000
       mean     385.000000
       std      247.487373
       min      210.000000
       25%      297.500000
       50%      385.000000
       75%      472.500000
       max      560.000000
Name: Fb, dtype: float64

# Mergin,Joining & Concatenating

In [63]:
import pandas as pd

In [65]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [66]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [74]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [68]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [69]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [70]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenation

In [75]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [76]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging

In [77]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [78]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [79]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [80]:
pd.merge(left,right, how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [81]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [82]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [83]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [87]:
pd.merge(left,right, how='inner', on=['key1','key2']) # only matching key

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [90]:
 pd.merge(left,right,how='outer', on=['key1','key2']) # all values merge together

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [92]:
 pd.merge(left,right,how='right', on=['key1','key2']) # merge left dataframe values to right datafeame values

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [93]:
pd.merge(left,right,how='left', on=['key1','key2']) # merge left dataframe values to left datafeame values

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### Joining

In [104]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [95]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [96]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [97]:
left.join(right) # right inner join to left

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [98]:
 left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Pandas - Operations

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
# find unique value from data frame
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
# find numbr of unique values from data frame
df['col2'].nunique()

3

In [5]:
# how many times the value occures in the column
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [7]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
#no of value in each columns
df.count()

col1    4
col2    4
col3    4
dtype: int64

In [6]:
# conditinal selection
df[df['col1']>2]

col1  col2  col3
3     666   ghi     1
4     444   xyz     1
dtype: int64

In [10]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [13]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [14]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
# use custom function
def times2(x):
    return x*2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [15]:
# lenght of the each elements
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [17]:
# Lambda expression
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [26]:
# removing columns
df.drop('col1',axis=1) # make permanet change in main frame, use 'inplace = true'

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [21]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [27]:
# list of all columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [31]:
# list of all index
df.index

RangeIndex(start=0, stop=4, step=1)

In [32]:
# sorting
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [33]:
# is the value null or not
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [34]:
# pivot table
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [35]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN